# __SQL Review__
<hr>

#### - Create _connection_ Python with your SQL Database!
#### - Use ``Sakila`` database!
#### - If there isn't ``Sakila`` in your SQL Dataset, follow this guidance: https://dev.mysql.com/doc/sakila/en/sakila-installation.html

___

## Import Libraries

In [1]:
import pandas as pd 
import numpy as np 
import sqlalchemy as alc 
from sqlalchemy import create_engine
# import mysql.connector

## Create Connection

In [2]:
engine = create_engine('mysql+mysqlconnector://root:rafdyrizq@localhost/sakila')

## ``Tampilkan seluruh tabel di Database Sakila (Full Table)``

              Tables_in_sakila  Table_type
0                        actor  BASE TABLE
1                   actor_info        VIEW
2                      address  BASE TABLE
3                     category  BASE TABLE
4                         city  BASE TABLE
5                      country  BASE TABLE
6                     customer  BASE TABLE
7                customer_list        VIEW
8                         film  BASE TABLE
9                   film_actor  BASE TABLE
10               film_category  BASE TABLE
11                   film_list        VIEW
12                   film_text  BASE TABLE
13                   inventory  BASE TABLE
14                    language  BASE TABLE
15  nicer_but_slower_film_list        VIEW
16                     payment  BASE TABLE
17                      rental  BASE TABLE
18      sales_by_film_category        VIEW
19              sales_by_store        VIEW
20                       staff  BASE TABLE
21                  staff_list        VIEW
22                       store  BASE TABLE

In [3]:
query='''
show full tables;
'''
pd.read_sql_query(query, engine)

              Tables_in_sakila  Table_type
0                        actor  BASE TABLE
1                   actor_info        VIEW
2                      address  BASE TABLE
3                     category  BASE TABLE
4                         city  BASE TABLE
5                      country  BASE TABLE
6                     customer  BASE TABLE
7                customer_list        VIEW
8                         film  BASE TABLE
9                   film_actor  BASE TABLE
10               film_category  BASE TABLE
11                   film_list        VIEW
12                   film_text  BASE TABLE
13                   inventory  BASE TABLE
14                    language  BASE TABLE
15  nicer_but_slower_film_list        VIEW
16                     payment  BASE TABLE
17                      rental  BASE TABLE
18      sales_by_film_category        VIEW
19              sales_by_store        VIEW
20                       staff  BASE TABLE
21                  staff_list        VIEW
22                       store  BASE TABLE

<hr>

## __Soal__

### 1. Tampilkan Nama belakang aktor yang paling sering muncul!

  last_name  jumlah
0    KILMER       5

In [5]:
query='''
select * from actor
limit 5
;
'''
pd.read_sql_query(query,engine)

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [24]:
query='''
select 
last_name,
count(last_name) as jumlah

from actor

group by last_name
order by jumlah desc
limit 1
;
'''
pd.read_sql_query(query,engine)

  last_name  jumlah
0    KILMER       5

### 2. Tampilkan nama aktor yang memiliki nama belakang `KILMER`!

  Nama_Depan Nama_Belakang
0     SANDRA        KILMER
1      REESE        KILMER
2        FAY        KILMER
3     MINNIE        KILMER
4      OPRAH        KILMER

In [70]:
query='''
select 
first_name as Nama_Depan,
last_name as Nama_Belakang

from actor

where last_name = 'KILMER'
;
'''
pd.read_sql_query(query,engine)

  Nama_Depan Nama_Belakang
0     SANDRA        KILMER
1      REESE        KILMER
2        FAY        KILMER
3     MINNIE        KILMER
4      OPRAH        KILMER

### 3. Berapa banyak nama depan aktor (tanpa ada pengulangan/_distinct_)?

   Jumlah_Nama_Belakang
0                   128

In [30]:
query='''
select count(distinct(first_name)) as Jumlah_Nama_Depan

from actor

;
'''
pd.read_sql_query(query,engine)

   Jumlah_Nama_Depan
0                128

### 4. Tampilkan 5 nama depan acktor yang muncul hanya 1 kali di database Sakila!

  Nama_Belakang
0       ASTAIRE
1        BACALL
2          BALE
3          BALL
4     BARRYMORE

In [43]:
query='''
select 
first_name as Nama_Depan,
count(first_name) as jumlah

from actor

group by first_name
having jumlah=1
limit 5
;
'''
pd.read_sql_query(query,engine)

  Nama_Depan  jumlah
0   JENNIFER       1
1      BETTE       1
2      GRACE       1
3        JOE       1
4       ZERO       1

### 5.Apa kategori dari film ‘Academy Dinosaur’?

              title     category
0  ACADEMY DINOSAUR  Documentary

In [48]:
query='''
select *

from film_list

limit 3
;
'''
pd.read_sql_query(query,engine)

,FID,title,description,category,price,length,rating,actors
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,0.99,86,PG,"WARREN NOLTE, OPRAH KILMER, ROCK DUKAKIS, MENA..."
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,Horror,4.99,48,G,"CHRIS DEPP, SEAN GUINESS, MINNIE ZELLWEGER, BO..."
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,Documentary,2.99,50,NC-17,"BOB FAWCETT, CAMERON STREEP, NICK WAHLBERG, RA..."

In [68]:
query='''
select *

from film_category

limit 3
;
'''
pd.read_sql_query(query,engine)

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09
1        2           11 2006-02-15 05:07:09
2        3            6 2006-02-15 05:07:09

In [69]:
query='''
select *

from category

limit 3
;
'''
pd.read_sql_query(query,engine)

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27
2            3   Children 2006-02-15 04:46:27

In [66]:
query='''
select *

from film

limit 3
;
'''
pd.read_sql_query(query,engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Deleted Scenes, Behind the Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42

In [75]:
# IMPLICITE JOIN

query='''
select 
film.title,
category.name as category


from film, category, film_category

where film.film_id = film_category.film_id
and category.category_id = film_category.category_id
and film.title = 'ACADEMY DINOSAUR'
;
'''
pd.read_sql_query(query,engine)

              title     category
0  ACADEMY DINOSAUR  Documentary

In [84]:
# join

query='''
select 
film.title,
category.name as category

from film 
join film_category on film.film_id = film_category.film_id
join category on category.category_id = film_category.category_id

where film.title like 'ACADEMY DINOSAUR'
;
'''
pd.read_sql_query(query,engine)

              title     category
0  ACADEMY DINOSAUR  Documentary

In [71]:
query='''
select title, category

from film_list

where title = 'ACADEMY DINOSAUR'
;
'''
pd.read_sql_query(query,engine)

              title     category
0  ACADEMY DINOSAUR  Documentary

### 6. Tampilkan durasi film di kategori Horror!

  category  Rata_Durasi
0   Horror     112.4821

In [76]:
query='''
select 
category.name as category,
avg(film.length) as Rata_Durasi

from film, category, film_category
where film.film_id = film_category.film_id
and category.category_id = film_category.category_id

group by category.name
having category.name = 'Horror'
;
'''
pd.read_sql_query(query,engine)

  category  Rata_Durasi
0   Horror     112.4821

In [85]:
query='''
select 
category.name as category,
avg(film.length) as Rata_Durasi

from film 
join film_category on film.film_id = film_category.film_id
join category on category.category_id = film_category.category_id

group by category.name
having category.name = 'Horror'
;
'''
pd.read_sql_query(query,engine)

  category  Rata_Durasi
0   Horror     112.4821

In [54]:
query='''
select 
category,
avg(length) as Rata_Durasi

from film_list

group by category
having category like 'Horror'
;
'''
pd.read_sql_query(query,engine)

  category  Rata_Durasi
0   Horror     112.4821

### 7. Tampilkan kategori film yang memiliki rata-rata durasi (_average of length_) di bawah rata-rata kategori film Horror !

  Category  Rata_Durasi
0   Sports     128.2027
1    Games     127.8361
2  Foreign     121.6986
3    Drama     120.8387
4   Comedy     115.8276
5   Family     114.7826
6    Music     113.6471
7   Travel     113.3158

In [88]:
query='''
select 
category,
avg(length) as Rata_Durasi

from film_list

group by category
having avg(length) < (select avg(length) from film_list where category = 'Horror')
order by Rata_Durasi desc
;
'''
pd.read_sql_query(query,engine)

      category  Rata_Durasi
0     Classics     111.6667
1       Action     111.6094
2          New     111.1270
3    Animation     111.0152
4     Children     109.8000
5  Documentary     108.7500
6       Sci-Fi     108.1967

In [98]:
query='''
select 
category.name as category,
avg(film.length) as Rata_Durasi

from film 
join film_category on film.film_id = film_category.film_id
join category on category.category_id = film_category.category_id

group by category.name
having avg(film.length) < (select avg(film.length)
from film 
join film_category on film.film_id = film_category.film_id
join category on category.category_id = film_category.category_id
group by category.name
having category.name = 'Horror')

order by avg(film.length) desc
;
'''
pd.read_sql_query(query,engine)

      category  Rata_Durasi
0     Classics     111.6667
1       Action     111.6094
2          New     111.1270
3    Animation     111.0152
4     Children     109.8000
5  Documentary     108.7500
6       Sci-Fi     108.1967

In [99]:
query='''
select 
category.name as category,
avg(film.length) as Rata_Durasi

from film 
join film_category on film.film_id = film_category.film_id
join category on category.category_id = film_category.category_id

group by category.name
having avg(film.length) < (select avg(film.length)
from film 
join film_category on film.film_id = film_category.film_id
join category on category.category_id = film_category.category_id
where category.name = 'Horror')

order by avg(film.length) desc
;
'''
pd.read_sql_query(query,engine)

      category  Rata_Durasi
0     Classics     111.6667
1       Action     111.6094
2          New     111.1270
3    Animation     111.0152
4     Children     109.8000
5  Documentary     108.7500
6       Sci-Fi     108.1967

## 8. Siapa saja Actor yang membintangi film Academy Dinosaur

In [100]:
query='''
select * from film_actor limit 1
'''
pd.read_sql_query(query, engine)

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03

In [104]:
query='''
select * from actor limit 1
'''
pd.read_sql_query(query, engine)

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-15 04:34:33

In [101]:
query='''
select * from film limit 1
'''
pd.read_sql_query(query, engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Deleted Scenes, Behind the Scenes}",2006-02-15 05:03:42

In [107]:
query='''
select 
film.title,
actor.first_name,
actor.last_name

from film_actor
join film on film_actor.film_id = film.film_id 
join actor on film_actor.actor_id = actor.actor_id

where film.title = 'ACADEMY DINOSAUR'
'''
pd.read_sql_query(query, engine)

              title first_name last_name
0  ACADEMY DINOSAUR   PENELOPE   GUINESS
1  ACADEMY DINOSAUR  CHRISTIAN     GABLE
2  ACADEMY DINOSAUR    LUCILLE     TRACY
3  ACADEMY DINOSAUR     SANDRA      PECK
4  ACADEMY DINOSAUR     JOHNNY      CAGE
5  ACADEMY DINOSAUR       MENA    TEMPLE
6  ACADEMY DINOSAUR     WARREN     NOLTE
7  ACADEMY DINOSAUR      OPRAH    KILMER
8  ACADEMY DINOSAUR       ROCK   DUKAKIS
9  ACADEMY DINOSAUR       MARY    KEITEL

## 9.Film apa saja yang dibintangi oleh Scarlett Bening

In [118]:
query='''
select 
actor.first_name,
actor.last_name,
film.title

from film_actor
join film using (film_id) 
join actor using (actor_id)

where actor.first_name = 'Scarlett'
and actor.last_name = 'Bening'
'''
df = pd.read_sql_query(query, engine)
df

   first_name last_name                  title
0    SCARLETT    BENING      AMISTAD MIDSUMMER
1    SCARLETT    BENING     BEETHOVEN EXORCIST
2    SCARLETT    BENING  BULWORTH COMMANDMENTS
3    SCARLETT    BENING       CALIFORNIA BIRDS
4    SCARLETT    BENING          CREEPERS KANE
5    SCARLETT    BENING    DOUBTFIRE LABYRINTH
6    SCARLETT    BENING         DUDE BLINDNESS
7    SCARLETT    BENING           DURHAM PANKY
8    SCARLETT    BENING       EVE RESURRECTION
9    SCARLETT    BENING         FEATHERS METAL
10   SCARLETT    BENING           FIDDLER LOST
11   SCARLETT    BENING      FLATLINERS KILLER
12   SCARLETT    BENING        FULL FLATLINERS
13   SCARLETT    BENING         IDENTITY LOVER
14   SCARLETT    BENING       INVASION CYCLONE
15   SCARLETT    BENING              LUCK OPUS
16   SCARLETT    BENING            MOULIN WAKE
17   SCARLETT    BENING   RESERVOIR ADAPTATION
18   SCARLETT    BENING          ROOF CHAMPION
19   SCARLETT    BENING    SEATTLE EXPECATIONS
20   SCARLETT    BENING       SHAWSHANK BUBBLE
21   SCARLETT    BENING         SNATCH SLIPPER
22   SCARLETT    BENING          SUBMARINE BED
23   SCARLETT    BENING     TENENBAUMS COMMAND
24   SCARLETT    BENING           WORDS HUNTER
25   SCARLETT    BENING             YOUTH KICK